//Задача 10: Напишите программу, которая принимает на вход трёхзначное число
 //и на выходе показывает вторую цифру этого числа.

//456 -> 5
//782 -> 8
//918 -> 1

/* Console.WriteLine("Введите трехзначное число: ");
int a = int.Parse(Console.ReadLine());
int a1 = a / 10;
int a2 = a1 % 100;
int a3 = a2 % 10;
int a4 = a3 % 100;
Console.WriteLine(a3); */


//Задача 13: Напишите программу, которая выводит
 //третью цифру заданного числа или сообщает, 
 //что третьей цифры нет.
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6



 //Console.WriteLine("Введите число: ");
//int a = int.Parse(Console.ReadLine());
//int a1 = a % 10;
//Console.WriteLine("Вывести последнюю цифру: " + a1);

//if (a > 10)
//{
  //Console.WriteLine("Третьей цифры нет");
//}

 //Задача 15: Напишите программу, которая принимает на вход цифру,
  //обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

//Console.WriteLine("Введите номер дня: ");
//int day = int.Parse(Console.ReadLine());
//if (day > 7)
//{
 // Console.WriteLine("Повторите ввод");
//}
//if (day < 1)
//{
 // Console.WriteLine("Повторите ввод");
//}
//else if (day == 6)
//{
//Console.WriteLine("Да, это выходной день");
//}
//else if (day == 7)
//{
//Console.WriteLine("Да, это выходной день");
/* }
else 
{
  Console.WriteLine("Нет, это не выходной день");
} */
